app/controllers/api/v1/images_controller.rb

      def search
        if params[:gps].blank?
          render json: [{"error": "100", "msg": "必須パラメーターがありません", "required": {"key": "name"}}]
        else
          @image = Image.where("location like ?", "%" + params[:gps] + "%")

          if @image.empty?
---
SELECT "images".* FROM "images" WHERE "images"."location" = ?  [["location", "地下一階"]]
SELECT "images".* FROM "images"