app/controllers/images_controller.rb

  def index
    @q = Image.search(params[:q])
    @results = @q.result(distinct: true).page(params[:page])
---
SELECT "images".* FROM "images"
SELECT  DISTINCT "images".* FROM "images" LIMIT ? OFFSET ?  [["LIMIT", 20], ["OFFSET", 0]]
SELECT COUNT(*) FROM "images"

  def create
     @image = Image.new(image_params)
     if @image.save!
---
INSERT INTO "images" ("en_title", "ja_title", "en_content", "ja_content", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["en_title", "Shinjuku East Exit"], ["ja_title", "新宿駅 東口"], ["en_content", "っっっっd"], ["ja_content", ""], ["created_at", 2017-05-23 04:17:28 UTC], ["updated_at", 2017-05-23 04:17:28 UTC]]

  def show
    @q = Image.search(params[:q])
    @image = Image.find(params[:id])
---
SELECT  "images".* FROM "images" WHERE "images"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def edit
    @q = Image.search(params[:q])
    @image = Image.find(params[:id])
---
SELECT  "images".* FROM "images" WHERE "images"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def update
    @image = Image.find(params[:id])
    @image.update(image_params)
---
SELECT  "images".* FROM "images" WHERE "images"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "images" SET "en_title" = ?, "updated_at" = ? WHERE "images"."id" = ?  [["en_title", "Shinjuku Station East Exi"], ["updated_at", 2017-05-23 04:40:43 UTC], ["id", 1]]

  def destroy
    @image = Image.find(params[:id])
    if @image.delete
---
SELECT  "images".* FROM "images" WHERE "images"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "images" WHERE "images"."id" = ?  [["id", 1]]