app/controllers/movies_controller.rb

  def index
    @q = Movie.search(params[:q])
    @results = @q.result(distinct: true).page(params[:page])
---
SELECT "movies".* FROM "movies"
SELECT  DISTINCT "movies".* FROM "movies" LIMIT ? OFFSET ?  [["LIMIT", 20], ["OFFSET", 0]]
SELECT COUNT(*) FROM "movies"

  def create
    @movie = Movie.new(movie_params)
    if @movie.save!
---
INSERT INTO "movies" ("en_title", "ja_title", "en_content", "ja_content", "present", "destination", "key", "movie", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def show
    @q = Movie.search(params[:q])
    @movie = Movie.find(params[:id])
---
SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def edit
    @q = Movie.search(params[:q])
    @movie = Movie.find(params[:id])
---
SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def update
    @movie = Movie.find(params[:id])
    @movie.update(movie_params)
---
SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "movies" SET "en_title" = ?, "ja_title" = ?, "en_content" = ?, "ja_content" = ?, "movie" = ?, "updated_at" = ? WHERE "movies"."id" = ?

  def destroy
    @movie = Movie.find(params[:id])
    if @movie.delete
---
SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "movies" WHERE "movies"."id" = ?  [["id", 1]]